<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Ditto Connect and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dev-yeet.munki.DittoConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ditto</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>MUNKI_ICON</key>
		<string>Ditto.png</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Screen mirroring for your Mac.</string>
			<key>developer</key>
			<string>Air Squirrels</string>
			<key>display_name</key>
			<string>Ditto</string>
			<key>icon_name</key>
			<string>%MUNKI_ICON%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
			<string>#!/bin/bash

#create directory if it doesn't exist				
mkdir -p /Library/Audio/Plug-Ins/HAL
				
#copy driver from application to /Library/Audio/Plug-Ins/Hal/ to prevent driver prompt on launch
cp -r /Applications/Ditto.app/Contents/Resources/User-Space/SquirrelsLoopbackAudioDriver.driver /Library/Audio/Plug-Ins/HAL/SquirrelsLoopbackAudioDriver.driver

exit 0</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dev-yeet.download.DittoConnect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_appname</key>
				<string>%NAME%.app</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
