<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Office 2019 SKU-less installer package.
		
</string>
	<key>Identifier</key>
	<string>com.github.dotslashjab.ksu-munki-recipes.Office2019Suite</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.office-recipes.download.Office2019Suite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Office2019Suite</string>
		<key>DISPLAY_NAME</key>
		<string>Office2019/365</string>
		<key>REGION</key>
		<string>2009112</string>
		<key>INSTALLERTYPE</key>
		<string>o365</string>
		<key>DOWNLOAD_URL_BASE</key>
		<string>https://go.microsoft.com/fwlink/?linkid=</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/microsoft</string>
		<key>MUNKI_ICON</key>
        	<string>MSOffice2016.png</string>
		<key>MINIMUM_OS_VERSION</key>
		<string>10.12</string>
		<key>pkginfo</key>
		<dict>
			<key>icon_name</key>
			<string>%MUNKI_ICON%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>blocking_applications</key>
			<array>
					<string>Microsoft AutoUpdate</string>
					<string>Microsoft Outlook</string>
					<string>Microsoft Excel</string>
					<string>Microsoft PowerPoint</string>
					<string>Microsoft Word</string>
					<string>Microsoft OneNote</string>
					<string>Microsoft Teams</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>installer_choices_xml</key>
			<array>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.autoupdate</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.teams</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.excel</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>0</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.OneDrive</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.onenote.mac</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.outlook</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.powerpoint</string>
				</dict>
				<dict>
					<key>attributeSetting</key>
					<integer>1</integer>
					<key>choiceAttribute</key>
					<string>selected</string>
					<key>choiceIdentifier</key>
					<string>com.microsoft.word</string>
				</dict>
			</array>
			</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
