<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>
		Downloads the latest LockDown Browser Package using the Respondus Lockdown Recipes maintained by nstrauss
		
		https://github.com/autopkg/nstrauss-recipes/tree/master/Respondus%20LockDown%20Browser
		
		When you create an override for this recipe, make sure to change the "Institution_ID" and "LAB_HASH" vales to reflect your organization.
		This will result in a lab deployment ready package containing id.txt and lab.txt with the corresponding values. 
</string>
	<key>Identifier</key>
	<string>com.github.KSU-Mac-Desktop-Engineering.munki.LockDownBrowser</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.pkg.RespondusLockDownBrowserLab</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LockDown Browser - Lab</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/respondus/lockdownbrowser</string>
		<key>MUNKI_ICON</key>
        	<string>RespondusLDB.png</string>
		<key>MINIMUM_OS_VERSION</key>
		<string>10.12</string>
		<key>SEARCH_URL</key>
        <string>https://www.respondus.com/lockdown/download.php?id=%INSTITUTION_ID%</string>
		<key>SEARCH_DOWNLOAD_URL</key>
        <string>https://download.respondus.com/lockdown/download7.php?id=%INSTITUTION_ID%</string>
		<key>pkginfo</key>
		<dict>
			<key>icon_name</key>
			<string>%MUNKI_ICON%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>%MINIMUM_OS_VERSION%</string>
			<key>supported_architectures</key>
			<array>
				<string>x86_64</string>
				<string>arm64</string>
			</array>
			<key>blocking_applications</key>
			<array>
					<string>LockDown Browser</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Proctoring</string>
			<key>developer</key>
			<string>Respondus</string>
			</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
            		<key>Processor</key>
            		<string>MunkiInstallsItemsCreator</string>
            		<key>Arguments</key>
    			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
				    <string>/Applications/LockDown Browser.app</string>
				</array>
			</dict>
       		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
               			<string>%RECIPE_CACHE_DIR%/RespondusLockDownBrowserLab-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>