<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Office 2019 SKU-less installer package.
		
</string>
	<key>Identifier</key>
	<string>com.github.KSU-Mac-Desktop-Engineering.munki.LockDownBrowser</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.download.RespondusLockDownBrowser</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Respondus LockDown Browser</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/respondus/lockdownbrowser</string>
		<key>MUNKI_ICON</key>
        	<string>RespondusLDB.png</string>
		<key>MINIMUM_OS_VERSION</key>
		<string>10.12</string>
 		<key>INSTITUTION_ID</key>
        <string>000000000</string>
		<key>SEARCH_URL</key>
        <string>https://www.respondus.com/lockdown/download.php?id=%INSTITUTION_ID%</string>
		<key>SEARCH_DOWNLOAD_URL</key>
        <string>https://download.respondus.com/lockdown/download7.php?id=%INSTITUTION_ID%</string>
		<key>pkginfo</key>
		<dict>
			<key>icon_name</key>
			<string>%MUNKI_ICON%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>%MINIMUM_OS_VERSION%</string>
			<key>blocking_applications</key>
			<array>
					<string>LockDown Browser</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Proctoring</string>
			<key>developer</key>
			<string>Respondus</string>
			</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
